// -------------------------------------------------------------------------- //
//! @file   cBGSceneChange.h
//! @brief  シーン遷移
//! @author Nal
//! @since  13/09/19(木)
//!
//! COPYRIGHT (C) 2013 EDELWEISS ALL RIGHT RESERVED
// -------------------------------------------------------------------------- //
#pragma	once
/* ====< インクルード >====================================================== */
#include "../Core/tBG.h"

/* ========================================================================= */
//		BGSceneChange														 */
/* ========================================================================= */
class BGSceneChange
{
public:
	//!	コンストラクタ
	BGSceneChange();
	//!	デストラクタ
	virtual	~BGSceneChange();

public:	
	/* ========================================================================= */
	//		BGSceneChange::cSceneTable											 */
	/* ========================================================================= */
	class cSceneTable
	{
	public:
		cSceneTable( f32 fTiming, u8 uScene )
		:	mTiming(fTiming), mScene(uScene)
		{}
		virtual	~cSceneTable()	{}

		f32	mTiming;	//!< コールタイミング
		u8	mScene;		//!< 変更シーン
	};
	/* ========================================================================= */
	//		BGSceneChange::cParamTable											 */
	/* ========================================================================= */
	class cParamTable
	{
	public:
		cParamTable( f32 fTiming, u32 uTransTime, u8 uParam )
		:	mTiming(fTiming), mTransTime(uTransTime), mParam(uParam)
		{}
		virtual	~cParamTable()	{}

		f32	mTiming;	//!< コールタイミング
		u32	mTransTime;	//!< 推移時間
		u8	mParam;		//!< 変更シーンパラメータ
	};

	/* ========================================================================= */
	//		BGSceneChange::cSet													 */
	/* ========================================================================= */
	class cSet
	{
	public:
		//!	コンストラクタ
		cSet()	{}
		//!	デストラクタ
		virtual	~cSet()	{}
		
		//		関数		
		//!	更新
		void	update( tBG& Bg, TGL::PathCamera* pCam );
		
		//!	シーン遷移追加
		void	addScene( const cSceneTable& table )	{ mScene.push_back( table ); }
		
		//!	シーンパラメータ遷移追加
		void	addParam( const cParamTable& table )	{ mParam.push_back( table ); }
		
		//		変数		
		stl::vector<cSceneTable>	mScene;	//!< シーン遷移
		stl::vector<cParamTable>	mParam;	//!< シーンパラメータ遷移
	};

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------
	//!	更新
	void	update( tBG& Bg );
	
	//		アクセサ		
	stl::map<u16, cSet>&	getSet()	{ return mSet; }

protected:
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		変数		
	// -----------------------------------------------------------------
	stl::map<u16, cSet>	mSet;	//!< セット
};

/* ========================================================================= */
/*		EOF																	 */
/* ========================================================================= */
