// -------------------------------------------------------------------------- //
//! @file   cModelSetSort.h
//! @brief  モデルセットのソート制御
//! @author Nal
//! @since  12/12/17(月)
//!
//! COPYRIGHT (C) 2012 EDELWEISS ALL RIGHT RESERVED
// -------------------------------------------------------------------------- //
#pragma	once
/* ====< インクルード >====================================================== */
#include "cModelSet.h"
#include "../Core/tBG.h"

/* ========================================================================= */
//		cModelSetSort														 */
/* ========================================================================= */
class cModelSetSort
{
public:
	//!	コンストラクタ
	cModelSetSort( tBG& owner );
	//!	デストラクタ
	virtual ~cModelSetSort();

public:	
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------
	//!	ソート実行
	void	sort();
	
	//!	ソート関数設定
	void	setSortCB( bool	(*p0)(cModelSet*, cModelSet*) )	{ mpSortCB = p0; }
	//!	ソート関数 Zソート（遠くから）
	static bool	sortCB_ZFar( cModelSet* pA, cModelSet* pB );
	//!	ソート関数 Zソート（近くから）
	static bool	sortCB_ZNear( cModelSet* pA, cModelSet* pB );
	
	//		アクセサ	
	void	setArray( stl::vector<cModelSet*>* p0 )	{ mpArray = p0; }
	u16		getBegin() const	{ return mBegin; }
	void	setBegin( u16 i0 ) 	{ mBegin = i0; }
	u16		getEnd() const		{ return mEnd; }
	void	setEnd( u16 i0 ) 	{ mEnd = i0; }
	u32		getScene() const	{ return mScene; }
	void	setScene( u32 i0 ) 	{ mScene = i0; }
	
	
private:
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		変数		
	// -----------------------------------------------------------------
	tBG&	mOwner;	//!< オーナー
	stl::vector<cModelSet*>*	mpArray;	//!< 対象配列
	u16		mBegin;	//!< ソート開始
	u16		mEnd;	//!< ソート終端
	u32		mScene;	//!< 有効シーン
	bool	(*mpSortCB)( cModelSet*, cModelSet* );	//!< ソート関数コールバック
};

/* ========================================================================= */
/*		EOF																	 */
/* ========================================================================= */
