// -------------------------------------------------------------------------- //
//! @file   tBGStg06DM.h
//! @brief  
//! @author Nal
//! @since  13/08/30(金)
//!
//! COPYRIGHT (C) 2013 EDELWEISS ALL RIGHT RESERVED
// -------------------------------------------------------------------------- //
#pragma	once
/* ====< インクルード >====================================================== */
#include "tBGStg06.h"

/* ========================================================================= */
//		DMBGStg06															 */
/* ========================================================================= */
class BGViewer;
class tBGStage5;

class DMBGStg06 : public TGL::DMenu
{
public:
	DMBGStg06( TGL::DMenuRoot* pRoot, BGViewer* pOwner, tBGStg06* pTask );
	virtual ~DMBGStg06();

public:
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------
	enum {
		//!	項目ID
		ITEMID_DRIVEOBJ_ROLL,	//!< ドライブObj回転
		ITEMID_MAX,

		//!	UV速度
		UVSPD_FAR01 = 0,		//!< 遠景01 星
		UVSPD_LOOP01_A,			//!< ループ01A
		UVSPD_LOOP01_B,			//!< ループ01B
		UVSPD_LOOP01_C,			//!< ループ01C
		UVSPD_LOOP01_D,			//!< ループ01D
		UVSPD_DRIVEOBJ_A,		//!< ドライブObjA
		UVSPD_DRIVEOBJ_B,		//!< ドライブObjB
		UVSPD_MOTHER_GLOW,		//!< 母星
		UVSPD_MOTHER_GLOW2,		//!< 母星
		UVSPD_MOTHER_CLOUD,		//!< 母星
		UVSPD_MOTHER_HOLE,		//!< 母星
		UVSPD_MOTHER_STRING,	//!< 母星
		UVSPD_MOTHER_STRING2,	//!< 母星
		UVSPD_MAX,
	};

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------
	//!	セットアップ
	virtual void	setup();

	//!	更新
	virtual void	update();
	//!	項目更新
	virtual void	updateItem();
	//!	項目表示
	virtual void	dispItem( TGL::DMenuItem* pItem, bool bCurrent, RGBA32 uColor=0xFFFFFFFF );
	//!	表示判定
	virtual bool	isDisp() const	{ return !KBBTN_DAT(KBBTN_F3); }

	//		アクセサ		
	

private:
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------
	//!	UV値取得
	TGL::Vec2*	getTaskUV( u8 uId );

	// -----------------------------------------------------------------
	//		変数		
	// -----------------------------------------------------------------
	BGViewer*	mpOwner;	//!< オーナー
	tBGStg06*	mpTask;		//!< 背景タスク
};

/* ========================================================================= */
/*		EOF																	 */
/* ========================================================================= */
