// -------------------------------------------------------------------------- //
//! @file   cChrColDmg.cpp
//! @brief  ダメージ判定
//! @author Nal
//! @since  12/08/01(水)
//!
//! COPYRIGHT (C) 2012 EDELWEISS ALL RIGHT RESERVED
// -------------------------------------------------------------------------- //
/* ====< インクルード >====================================================== */
#include "prefix.h"
#include <TGL.h>
#include "Game/Game.h"
#include "cChrColDmg.h"
#include "Action/ActionTypes.h"

/* ========================================================================= */
/*		cChrColDmg															 */
/* ========================================================================= */
// ---------------------------------------------
//! @brief  コンストラクタ "cChrColDmg"
// ---------------------------------------------
cChrColDmg::cChrColDmg()
:	TGL::ColSphere(), mpLife(NULL), mbAttr2D(false), mPos(TGL::Vec3::ZERO), mAdjustPos(TGL::Vec3::ZERO)
{
}

// ---------------------------------------------
//! @brief  デストラクタ "cChrColDmg"
// ---------------------------------------------
cChrColDmg::~cChrColDmg()
{
}

// ---------------------------------------------
//! @brief  2D平面上での計算設定
//! @param  b0	[in]	true:2D計算させる
// ---------------------------------------------
void cChrColDmg::set2D( bool b2D )
{
	//!	外部からfalse設定されてる場合は固有属性に従う
	if( !b2D )
		b2D = mbAttr2D;

	//!	正面スクロール時は無効
	if( IACtrl->getScene().getScrollType() == SCROLL_FRONT )	b2D = false;
	
	TGL::ColSphere::set2D( b2D );
}

/* ========================================================================= */
/*		EOF																	 */
/* ========================================================================= */
