// -------------------------------------------------------------------------- //
//! @file   cBGDoorStg05.h
//! @brief  ドア
//! @author Nal
//! @since  13/09/14(土)
//!
//! COPYRIGHT (C) 2013 EDELWEISS ALL RIGHT RESERVED
// -------------------------------------------------------------------------- //
#pragma	once
/* ====< インクルード >====================================================== */
#include "../../Class/cBGDoor.h"
#include "Sound/sAppSound.h"

/* ========================================================================= */
//		BGDoorStg05															 */
/* ========================================================================= */
class BGDoorStg05 : public BGDoor
{
public:
	//!	コンストラクタ
	BGDoorStg05( cModelSet* pModelSet, u8 uSceneS, u8 uSceneE, u8 uCamGroup, f32 fCall, f32 fAnmFrame )
	:	BGDoor( pModelSet, uSceneS, uSceneE, uCamGroup, fCall, fAnmFrame )
	{
		reset();
	}
	
	//!	デストラクタ
	virtual	~BGDoorStg05() {}

public:	
	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------

protected:
	// -----------------------------------------------------------------
	//		定義		
	// -----------------------------------------------------------------

	// -----------------------------------------------------------------
	//		関数		
	// -----------------------------------------------------------------
	//!	ドア移動音
	virtual s16	getSELoop() const			{ return SE_S5_DOORMOVE_LOOP; }
	virtual f32	getSELoopDistance() const	{ return 1000.0f; }
	//!	ドア閉まった音
	virtual s16	getSEClose() const			{ return SE_S5_DOORCLOSE; }
	virtual f32	getSECloseDistance() const	{ return 8000.0f; }
	
	//!	カメラ振動強さ
	virtual TGL::Vec3		getShakePower() const	{ return TGL::Vec3(10,10,0); }

	// -----------------------------------------------------------------
	//		変数		
	// -----------------------------------------------------------------
};

/* ========================================================================= */
/*		EOF																	 */
/* ========================================================================= */
